Terraform Plan:

```
module.cloudflare_dns.data.cloudflare_zone.zone: Reading...
module.cloudflare_dns.data.cloudflare_zone.zone: Read complete after 0s [id=7d3f63ac039666ab600b5796c54e7ba6]
oci_identity_compartment.k8s: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa4bbfmz332ypqxr6icuitp54jj7czdp4qliuo575ytuqakppgtmra]
module.virtual_machine.data.oci_identity_availability_domains.ads: Reading...
module.virtual_network.oci_core_vcn.vcn["vcn1"]: Refreshing state... [id=ocid1.vcn.oc1.eu-frankfurt-1.amaaaaaaic6ifviawy53vzv7ylnbovxzlk6gdl3wj62qt7pazvsl3pinvxiq]
module.virtual_machine.data.oci_identity_availability_domains.ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-2220574233]
module.virtual_network.oci_core_internet_gateway.igw["vcn1"]: Refreshing state... [id=ocid1.internetgateway.oc1.eu-frankfurt-1.aaaaaaaafkt7nrvasfyvu4a7daqfqskkfh4vmbqpye7qr35abqnhrumie32a]
module.virtual_network.oci_core_network_security_group.nsg["vcn1"]: Refreshing state... [id=ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaaphiusldsxpmy7odws7mwaitxvfeu52ntgbb2vkwe7fzhvyckb45q]
module.virtual_network.oci_core_route_table.rt["vcn1"]: Refreshing state... [id=ocid1.routetable.oc1.eu-frankfurt-1.aaaaaaaa5jyv5xby72ed73eqsxt3t7o6z7symzmk3we5rhpongsnakijdzba]
module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule3"]: Refreshing state... [id=868C1D]
module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule2"]: Refreshing state... [id=73C8D4]
module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule1"]: Refreshing state... [id=96F721]
module.virtual_network.oci_core_subnet.subnet["subnet1"]: Refreshing state... [id=ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaatfy3s5otqei4lcl7czf6jk7bliptcfwx4e35otvnd5muldjqutea]
module.virtual_machine.oci_core_volume.volume["worker1"]: Refreshing state... [id=ocid1.volume.oc1.eu-frankfurt-1.abtheljtwg7cmno4sc2puykujokfdwsk4odenr6sxgu5uktoeec73dae6zna]
module.virtual_machine.oci_core_volume.volume["vojta"]: Refreshing state... [id=ocid1.volume.oc1.eu-frankfurt-1.abtheljt3kiyigqvv454mkgcaoo6vpkonw7jzcrh6shztzxgwyzwgotxkh2a]
module.virtual_machine.oci_core_instance.vm["vojta"]: Refreshing state... [id=ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvicypgg5vhiehopvpqo52ujadvq2ldxr3dy4vkun3oznwoa]
module.virtual_machine.oci_core_instance.vm["worker1"]: Refreshing state... [id=ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvicyrvcdxqz6zmx6ahdsk44e4q23h6zabdlvo2csswwy57a]
module.virtual_machine.oci_core_volume_attachment.volume_attachment["vojta"]: Refreshing state... [id=ocid1.volumeattachment.oc1.eu-frankfurt-1.antheljtic6ifvic5btcelvucomleeibwyq2fjcvyedbdcmi64itnyzut3nq]
module.cloudflare_dns.cloudflare_record.a_record["worker1"]: Refreshing state... [id=85b2b2202a344df108f0d1f90ab7a0c6]
module.cloudflare_dns.cloudflare_record.a_record["vojta"]: Refreshing state... [id=34a708586afa308145ac6bb195c060d4]
module.virtual_machine.oci_core_volume_attachment.volume_attachment["worker1"]: Refreshing state... [id=ocid1.volumeattachment.oc1.eu-frankfurt-1.antheljtic6ifvicl3uex6qjmrdvm4vqkyb3xfmceru6xzaids6owd2i2a7a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.cloudflare_dns.cloudflare_record.a_record["neptun"] will be created
  + resource "cloudflare_record" "a_record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "neptun"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "7d3f63ac039666ab600b5796c54e7ba6"
    }

  # module.cloudflare_dns.cloudflare_record.a_record["vojta"] will be destroyed
  # (because key ["vojta"] is not in for_each map)
  - resource "cloudflare_record" "a_record" {
      - allow_overwrite = false -> null
      - created_on      = "2023-12-16T12:39:16.189684Z" -> null
      - hostname        = "vojta.germanium.cz" -> null
      - id              = "34a708586afa308145ac6bb195c060d4" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2023-12-16T12:39:16.189684Z" -> null
      - name            = "vojta" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "89.168.75.207" -> null
      - zone_id         = "7d3f63ac039666ab600b5796c54e7ba6" -> null
    }

  # module.virtual_machine.oci_core_instance.vm["neptun"] will be created
  + resource "oci_core_instance" "vm" {
      + availability_domain                 = "YnJT:EU-FRANKFURT-1-AD-3"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "neptun"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAgEApUVk+sbM7bAiCzuMzE4N3ShweHsoHuhejsUiB4xRqtGsQtkl3VIfDHJ1rFI4F/gLraLJRmnH+BMBHXjrO/+PiYTKsDeIuOYzAAUGVVPd/SSiB3fXAmpPtlHyoFQ4IlpzkhaKro2FBA01d3l1rMwhy5osRj7S3aQaUJ1phMbjWqBswbeM2sHns6cPo5l5zX9HbI0NPSYOnSBiXypQMPq+7T5K8oNW8AC9DcuAy2ps9WwDSJi9tUPOZXdSTalWGdGPzBRrDohK8JwGWcVnMHl7bjNkhMr5dZpZNQOj859qM+K4KzY1m29/4Vh9yUyWKn8Odx1+clBEEesXobGKgriEhEXSUYWpXYlG4JxFNNvonlsIPQ4MxDBSZs3e6s/6MHOzYM+JmlQuBl6OR83AzxLsHD+f0UDmLEY7oLy4VvX8c8kt2a5ql5s9mTQ5ydJCdqvJOMGaz+vHd+V5ueuMm5Ibcq7HzidQb6XROG/hVOR7e0mi7JCqq1tRTB3tcTjOVNZ93MjrBV1f94AnNQP+67lBI3wmItEntUyMD2I26ffcMcmKPLe/aAHD0iJcY5RG/v5zyHKV9tQt59oBJUEpNgPS1qFY98ie5mgwW1EGCxDcd+5RaBWYTo1tGjLONBdchbWGHXEcM58toep3I0e8NlDjE9SewblLR/SEHx4LG6uSxU8= oracle-cloud_2021-09-0"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.E2.1.Micro"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = [
              + "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaaphiusldsxpmy7odws7mwaitxvfeu52ntgbb2vkwe7fzhvyckb45q",
            ]
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = "ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaatfy3s5otqei4lcl7czf6jk7bliptcfwx4e35otvnd5muldjqutea"
          + vlan_id                = (known after apply)
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 1
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq"
          + source_type             = "image"
        }
    }

  # module.virtual_machine.oci_core_instance.vm["vojta"] will be destroyed
  # (because key ["vojta"] is not in for_each map)
  - resource "oci_core_instance" "vm" {
      - availability_domain  = "YnJT:EU-FRANKFURT-1-AD-3" -> null
      - boot_volume_id       = "ocid1.bootvolume.oc1.eu-frankfurt-1.abtheljtvlpbn3leqet4l2bm4ntkrxupt2km4yvhinafaruc7k25c6mde4fq" -> null
      - compartment_id       = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya" -> null
      - defined_tags         = {
          - "Oracle-Tags.CreatedBy" = "default/petr.nemec@gmx.com"
          - "Oracle-Tags.CreatedOn" = "2023-12-16T12:38:39.732Z"
        } -> null
      - display_name         = "vojta" -> null
      - extended_metadata    = {} -> null
      - fault_domain         = "FAULT-DOMAIN-2" -> null
      - freeform_tags        = {} -> null
      - id                   = "ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvicypgg5vhiehopvpqo52ujadvq2ldxr3dy4vkun3oznwoa" -> null
      - image                = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq" -> null
      - is_cross_numa_node   = false -> null
      - launch_mode          = "PARAVIRTUALIZED" -> null
      - metadata             = {
          - "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAgEApUVk+sbM7bAiCzuMzE4N3ShweHsoHuhejsUiB4xRqtGsQtkl3VIfDHJ1rFI4F/gLraLJRmnH+BMBHXjrO/+PiYTKsDeIuOYzAAUGVVPd/SSiB3fXAmpPtlHyoFQ4IlpzkhaKro2FBA01d3l1rMwhy5osRj7S3aQaUJ1phMbjWqBswbeM2sHns6cPo5l5zX9HbI0NPSYOnSBiXypQMPq+7T5K8oNW8AC9DcuAy2ps9WwDSJi9tUPOZXdSTalWGdGPzBRrDohK8JwGWcVnMHl7bjNkhMr5dZpZNQOj859qM+K4KzY1m29/4Vh9yUyWKn8Odx1+clBEEesXobGKgriEhEXSUYWpXYlG4JxFNNvonlsIPQ4MxDBSZs3e6s/6MHOzYM+JmlQuBl6OR83AzxLsHD+f0UDmLEY7oLy4VvX8c8kt2a5ql5s9mTQ5ydJCdqvJOMGaz+vHd+V5ueuMm5Ibcq7HzidQb6XROG/hVOR7e0mi7JCqq1tRTB3tcTjOVNZ93MjrBV1f94AnNQP+67lBI3wmItEntUyMD2I26ffcMcmKPLe/aAHD0iJcY5RG/v5zyHKV9tQt59oBJUEpNgPS1qFY98ie5mgwW1EGCxDcd+5RaBWYTo1tGjLONBdchbWGHXEcM58toep3I0e8NlDjE9SewblLR/SEHx4LG6uSxU8= oracle-cloud_2021-09-0"
        } -> null
      - preserve_boot_volume = false -> null
      - private_ip           = "10.1.1.178" -> null
      - public_ip            = "89.168.75.207" -> null
      - region               = "eu-frankfurt-1" -> null
      - shape                = "VM.Standard.E2.1.Micro" -> null
      - state                = "RUNNING" -> null
      - subnet_id            = "ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaatfy3s5otqei4lcl7czf6jk7bliptcfwx4e35otvnd5muldjqutea" -> null
      - system_tags          = {
          - "orcl-cloud.free-tier-retained" = "true"
        } -> null
      - time_created         = "2023-12-16 12:38:40.297 +0000 UTC" -> null

      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null
        }

      - availability_config {
          - is_live_migration_preferred = false -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      - create_vnic_details {
          - assign_private_dns_record = false -> null
          - assign_public_ip          = "true" -> null
          - defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/petr.nemec@gmx.com"
              - "Oracle-Tags.CreatedOn" = "2023-12-16T12:38:39.851Z"
            } -> null
          - display_name              = "vojta" -> null
          - freeform_tags             = {} -> null
          - nsg_ids                   = [
              - "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaaphiusldsxpmy7odws7mwaitxvfeu52ntgbb2vkwe7fzhvyckb45q",
            ] -> null
          - private_ip                = "10.1.1.178" -> null
          - skip_source_dest_check    = false -> null
          - subnet_id                 = "ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaatfy3s5otqei4lcl7czf6jk7bliptcfwx4e35otvnd5muldjqutea" -> null
        }

      - instance_options {
          - are_legacy_imds_endpoints_disabled = false -> null
        }

      - launch_options {
          - boot_volume_type                    = "PARAVIRTUALIZED" -> null
          - firmware                            = "UEFI_64" -> null
          - is_consistent_volume_naming_enabled = true -> null
          - is_pv_encryption_in_transit_enabled = false -> null
          - network_type                        = "PARAVIRTUALIZED" -> null
          - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
        }

      - shape_config {
          - gpus                          = 0 -> null
          - local_disks                   = 0 -> null
          - local_disks_total_size_in_gbs = 0 -> null
          - max_vnic_attachments          = 1 -> null
          - memory_in_gbs                 = 1 -> null
          - networking_bandwidth_in_gbps  = 0.47999998927116394 -> null
          - nvmes                         = 0 -> null
          - ocpus                         = 1 -> null
          - processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> null
        }

      - source_details {
          - boot_volume_size_in_gbs = "47" -> null
          - boot_volume_vpus_per_gb = "10" -> null
          - source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq" -> null
          - source_type             = "image" -> null
        }
    }

  # module.virtual_machine.oci_core_volume.volume["neptun"] will be created
  + resource "oci_core_volume" "volume" {
      + auto_tuned_vpus_per_gb = (known after apply)
      + availability_domain    = "YnJT:EU-FRANKFURT-1-AD-3"
      + backup_policy_id       = (known after apply)
      + compartment_id         = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + defined_tags           = (known after apply)
      + display_name           = "neptun_50GB"
      + freeform_tags          = (known after apply)
      + id                     = (known after apply)
      + is_auto_tune_enabled   = (known after apply)
      + is_hydrated            = (known after apply)
      + kms_key_id             = (known after apply)
      + size_in_gbs            = "50"
      + size_in_mbs            = (known after apply)
      + state                  = (known after apply)
      + system_tags            = (known after apply)
      + time_created           = (known after apply)
      + volume_backup_id       = (known after apply)
      + volume_group_id        = (known after apply)
      + vpus_per_gb            = (known after apply)
    }

  # module.virtual_machine.oci_core_volume.volume["vojta"] will be destroyed
  # (because key ["vojta"] is not in for_each map)
  - resource "oci_core_volume" "volume" {
      - availability_domain  = "YnJT:EU-FRANKFURT-1-AD-3" -> null
      - compartment_id       = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya" -> null
      - defined_tags         = {
          - "Oracle-Tags.CreatedBy" = "default/petr.nemec@gmx.com"
          - "Oracle-Tags.CreatedOn" = "2023-12-16T12:38:39.355Z"
        } -> null
      - display_name         = "vojta_50GB" -> null
      - freeform_tags        = {} -> null
      - id                   = "ocid1.volume.oc1.eu-frankfurt-1.abtheljt3kiyigqvv454mkgcaoo6vpkonw7jzcrh6shztzxgwyzwgotxkh2a" -> null
      - is_auto_tune_enabled = false -> null
      - is_hydrated          = true -> null
      - size_in_gbs          = "50" -> null
      - size_in_mbs          = "51200" -> null
      - state                = "AVAILABLE" -> null
      - system_tags          = {
          - "orcl-cloud.free-tier-retained" = "true"
        } -> null
      - time_created         = "2023-12-16 12:38:39.374 +0000 UTC" -> null
      - vpus_per_gb          = "10" -> null
    }

  # module.virtual_machine.oci_core_volume_attachment.volume_attachment["neptun"] will be created
  + resource "oci_core_volume_attachment" "volume_attachment" {
      + attachment_type                     = "paravirtualized"
      + availability_domain                 = (known after apply)
      + chap_secret                         = (known after apply)
      + chap_username                       = (known after apply)
      + compartment_id                      = (known after apply)
      + device                              = (known after apply)
      + display_name                        = (known after apply)
      + encryption_in_transit_type          = (known after apply)
      + id                                  = (known after apply)
      + instance_id                         = (known after apply)
      + ipv4                                = (known after apply)
      + iqn                                 = (known after apply)
      + is_agent_auto_iscsi_login_enabled   = (known after apply)
      + is_multipath                        = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + is_read_only                        = (known after apply)
      + is_shareable                        = (known after apply)
      + iscsi_login_state                   = (known after apply)
      + multipath_devices                   = (known after apply)
      + port                                = (known after apply)
      + state                               = (known after apply)
      + time_created                        = (known after apply)
      + use_chap                            = (known after apply)
      + volume_id                           = (known after apply)
    }

  # module.virtual_machine.oci_core_volume_attachment.volume_attachment["vojta"] will be destroyed
  # (because key ["vojta"] is not in for_each map)
  - resource "oci_core_volume_attachment" "volume_attachment" {
      - attachment_type                     = "paravirtualized" -> null
      - availability_domain                 = "YnJT:EU-FRANKFURT-1-AD-3" -> null
      - compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya" -> null
      - display_name                        = "volumeattachment20231216123916" -> null
      - id                                  = "ocid1.volumeattachment.oc1.eu-frankfurt-1.antheljtic6ifvic5btcelvucomleeibwyq2fjcvyedbdcmi64itnyzut3nq" -> null
      - instance_id                         = "ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvicypgg5vhiehopvpqo52ujadvq2ldxr3dy4vkun3oznwoa" -> null
      - is_pv_encryption_in_transit_enabled = false -> null
      - is_read_only                        = false -> null
      - is_shareable                        = false -> null
      - multipath_devices                   = [] -> null
      - state                               = "ATTACHED" -> null
      - time_created                        = "2023-12-16 12:39:16.423 +0000 UTC" -> null
      - volume_id                           = "ocid1.volume.oc1.eu-frankfurt-1.abtheljt3kiyigqvv454mkgcaoo6vpkonw7jzcrh6shztzxgwyzwgotxkh2a" -> null
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ vm_public_ip = {
      + neptun  = (known after apply)
      - vojta   = "89.168.75.207"
        # (1 unchanged attribute hidden)
    }
```

Plan saved to GH artifacts.